fe40/tutorials/rheoInterFoam/ImpactingDrop/Oldroyd-BLog/0/pd
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pd;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    atmosphere
    {
       type            fixedValue;
       value           uniform 0;
    }
    plate
    {
        type            fixedFluxPressure;
        Dp              "rAtU"; // "rAtU" for SIMPLEC; comment this line for PIMPLE
        value           uniform 0;
    }
    wFront
    {
	type            wedge;     
    }
    wBack
    {
	type            wedge;     
    }
    axis
    {
	type            empty;     
    }
}

// ************************************************************************* //
