fe40/tutorials/rheoInterFoam/ImpactingDrop/Oldroyd-BLog/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    grad(U)         Gauss linear;
    linExtrapGrad       Gauss linear;

}

divSchemes
{
    default                  none;
    div(Sum(tau))            Gauss linear; 
    div(grad(U))             Gauss linear;
    
    div(rho*phi,U)           Gauss limitedLinearV 1;
    
    div(phi,alpha)           Gauss vanLeer01;
    div(phirb,alpha)         Gauss linear;
    
    div(eta*alpha*dev2(T(gradU)))  Gauss linear;
    
    div(phi,theta1)     GaussDefCmpw cubista;
    div(phi,theta2)     GaussDefCmpw cubista;
    div(phi,tau1)       GaussDefCmpw cubista;
    div(phi,tau2)       GaussDefCmpw cubista;
    
}

laplacianSchemes
{
    default                             Gauss linear corrected;  
}

interpolationSchemes
{
    default        linear;      
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    pd;
    pcorr;
    alpha1;
}
// ************************************************************************* //
